{
    "books": [
        {
            "id": 1,
            "title": "Lady Dragon",
            "description": "Rachel Hartman's Seraphina meets The Priory of the Orange Tree in Lady Dragon, a sapphic YA romantasy from A.M. Strickland.\nThe age of queens is over . . . unless they can save it..\nSince the last war between humans and dragons left the leaders of both species slain—the last human king of Andrath and the legendary dragon queen—both queendoms have been living under a tentative truce: only women will sit on the throne of Andrath, the dragons will have free passage through the human lands . . . and if men ever try to retake the throne, the draconic realm will retaliate.\nSamansa and Kirek are two new leaders coming of age in war-scarred lands—Samansa a reluctant human princess and Kirek the favored contender for the draconic queenship. Per tradition, Kirek must undergo the distasteful task of using a mysterious gem called the Heartstone to shift into human form and maintain the strained ties between the species . . . and study human weaknesses, a new and secret task she’s been given by her queen. As the princess and the dragon girl grow closer, they are sent to investigate a potential breach of the treaty and encounter a plot that could reignite an even bloodier war. While fighting to maintain the peace their ancestors fought for and uncovering centuries-old secrets, Samansa and Kirek must grapple with betraying their clashing nations . . . or their unexpected feelings for each other.",
            "authorid": 1,
            "author": "A.M. Strickland",
            "ratings": 3.89,
            "genre": [
                "Fantasy",
                "Lesbian",
                "Dragons",
                "Young Adult",
                "Queer",
                "LGBT",
                "Romance",
                "Romantasy",
                "Fantasy Romance",
                "Science Fiction Fantasy"
            ],
            "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1736765765i/220908893.jpg"
        },
        {
            "id": 2,
            "title": "The Hunger Games",
            "description": "Winning means fame and fortune. Losing means certain death. The Hunger Games have begun. . . .\nIn the ruins of a place once known as North America lies the nation of Panem, a shining Capitol surrounded by twelve outlying districts. The Capitol is harsh and cruel and keeps the districts in line by forcing them all to send one boy and one girl between the ages of twelve and eighteen to participate in the annual Hunger Games, a fight to the death on live TV.\nSixteen-year-old Katniss Everdeen regards it as a death sentence when she steps forward to take her sister's place in the Games. But Katniss has been close to dead before-and survival, for her, is second nature. Without really meaning to, she becomes a contender. But if she is to win, she will have to start making choices that weigh survival against humanity and life against love.",
            "authorid": 2,
            "author": "Suzanne Collins",
            "ratings": 4.35,
            "genre": [
                "Young Adult",
                "Dystopia",
                "Fiction",
                "Fantasy",
                "Science Fiction",
                "Romance",
                "Adventure",
                "Audiobook",
                "Book Club",
                "Teen"
            ],
            "year": "September 14, 2008",
            "literaryAwards": [
                "Locus Award Nominee for Best Young Adult Book (2009) and for Illustrated and Art Book (2025)",
                "Georgia Peach Book Award (2009)",
                "Buxtehuder Bulle (2009)",
                "Golden Duck Award for Young Adult (Hal Clement Award) (2009)",
                "Grand Prix de l'Imaginaire Nominee for Roman jeunesse étranger (2010)",
                "Books I Loved Best Yearly (BILBY) Awards for Older Readers (2012)",
                "West Australian Young Readers' Book Award (WAYRBA) for Older Readers (2010)",
                "Red House Children's Book Award for Older Readers & Overall (2010)",
                "South Carolina Book Award for Junior and Young Adult Book (2011)",
                "Charlotte Award (2010)",
                "Colorado Blue Spruce Young Adult Book Award (2010)",
                "Teen Buckeye Book Award (2009)",
                "Pennsylvania Young Readers' Choice Award for Young Adults (2010)",
                "Rhode Island Teen Book Award (2010)",
                "Vermont Golden Dome Book Award (2010)",
                "Evergreen Teen Book Award (2011), Soaring Eagle Book Award (2009)",
                "Milwaukee County Teen Book Award Nominee (2010)",
                "Sakura Medal for Middle School Book (2010)",
                "Michigan Library Association Thumbs Up! Award (2009)",
                "Florida Teens Read (2009)",
                "Deutscher Jugendliteraturpreis for Preis der Jugendjury (2010)",
                "Iowa High School Book Award (2011)",
                "New Mexico Land of Enchantment Award for Young Adult (2011)",
                "Eliot Rosewater Indiana High School Book Award (2010)",
                "The Inky Awards for Silver Inky (2009)",
                "California Young Readers Medal for Young Adult (2011)",
                "Lincoln Award (2011)",
                "Kinderboekwinkelprijs (2010)",
                "Truman Readers Award (2011)",
                "CYBILS Award for Young Adult Fantasy & Science Fiction (2008)",
                "Literaturpreis der Jury der jungen Leser for Jugendbuch (2010)",
                "The Inky Awards Shortlist for Silver Inky (2009)",
                "Prix Et-lisez-moi (2011)",
                "Gateway Readers Award (2011)",
                "Oklahoma Sequoyah Book Award for High School and Intermediate (2011)",
                "Premio El Templo de las Mil Puertas for Mejor novela extranjera perteneciente a saga (2009)",
                "Rebecca Caudill Young Readers' Book Award (2011)",
                "LovelyBooks Leserpreis for Fantasy (2009)",
                "LovelyBooks Leserpreis for Bestes Cover/Umschlag (2009)",
                "Premi Protagonista Jove for Categoria 12-14 anys (2009)"
            ],
            "originalTitle": "The Hunger Games",
            "series": "The Hunger Games #1",
            "setting": [
                "Panem",
                "District 12",
                "The Capitol"
            ],
            "characters": [
                "Katniss Everdeen",
                "Peeta Mellark",
                "Cato (Hunger Games)",
                "Primrose Everdeen",
                "Gale Hawthorne",
                "Effie Trinket",
                "Haymitch Abernathy",
                "Cinna",
                "Rue",
                "Flavius",
                "Lavinia (Hunger Games)",
                "Marvel, Glimmer",
                "Clove",
                "Foxface",
                "Thresh",
                "Greasy Sae",
                "Madge Undersee",
                "Caesar Flickerman",
                "Claudius Templesmith",
                "Octavia (Hunger Games)",
                "Portia (Hunger Games)",
                "Coriolanus Snow"
            ],
            "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1736765765i/220908893.jpg"
        },
        {
            "id": 3,
            "title": "Catching Fire",
            "description": "Sparks are igniting.\nFlames are spreading.\nAnd the Capitol wants revenge.\n\nAgainst all odds, Katniss Everdeen has won the Hunger Games. She and fellow District 12 tribute Peeta Mellark are miraculously still alive. Katniss should be relieved, happy even. After all, she has returned to her family and her longtime friend, Gale. Yet nothing is the way Katniss wishes it to be. Gale holds her at an icy distance. Peeta has turned his back on her completely. And there are whispers of a rebellion against the Capitol—a rebellion that Katniss and Peeta may have helped create.\n\nMuch to her shock, Katniss has fueled an unrest that she's afraid she cannot stop. And what scares her even more is that she's not entirely convinced she should try. As time draws near for Katniss and Peeta to visit the districts on the Capitol's cruel Victory Tour, the stakes are higher than ever. If they can't prove, without a shadow of a doubt, that they are lost in their love for each other, the consequences will be horrifying.\nIn Catching Fire, the second novel of the Hunger Games trilogy, Suzanne Collins continues the story of Katniss Everdeen, testing her more than ever before . . . and surprising readers at every turn.",
            "authorid": 2,
            "author": "Suzanne Collins",
            "ratings": 4.35,
            "genre": [
                "Young Adult",
                "Dystopia",
                "Fiction",
                "Fantasy",
                "Science Fiction",
                "Romance",
                "Adventure",
                "Audiobook",
                "Teen",
                "Post Apocalyptic"
            ],
            "year": "September 14, 2008",
            "literaryAwards": [
                "Locus Award Nominee for Best Young Adult Book (2010)",
                "Golden Duck Award for Young Adult (Hal Clement Award) (2010)",
                "Soaring Eagle Book Award (2011)",
                "Children's Choice Book Award for Teen Choice Book of the Year (2010)",
                "Indies Choice Book Award for Young Adult (2010)",
                "Teen Read Award Nominee for Best Read (2010)",
                "DABWAHA Romance Tournament for Best Young Adult (2010)",
                "Goodreads Choice Award for Favorite Book and Young Adult Series (2009) and Nominee for Best of the Best (2018)",
                "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera perteneciente a saga (2010)"
            ],
            "originalTitle": "Catching Fire",
            "series": "The Hunger Games #2",
            "setting": [
                "Panem",
                "District 12",
                "The Capitol"
            ],
            "characters": [
                "Katniss Everdeen",
                "Peeta Mellark",
                "Primrose Everdeen",
                "Gale Hawthorne",
                "Effie Trinket",
                "Haymitch Abernathy",
                "Cinna",
                "Finnick Odair",
                "Johanna Mason",
                "Madge Undersee",
                "Caesar Flickerman",
                "Twill",
                "Cashmere",
                "Gloss",
                "Enobaria",
                "Beetee Latier",
                "Wiress",
                "Mags Flanagan",
                "Blight",
                "Woof",
                "Cecilia",
                "Chaff",
                "Seeder",
                "Plutarch Heavensbee",
                "Octavia (Hunger Games)",
                "Portia (hunger Games)",
                "Coriolanus Snow"
            ],
            "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1586722941i/6148028.jpg"
        },
        {
            "id": 4,
            "title": "Mockingjay",
            "description": "My name is Katniss Everdeen.\nWhy am I not dead?\nI should be dead.\n\nKatniss Everdeen, girl on fire, has survived, even though her home has been destroyed. Gale has escaped. Katniss's family is safe. Peeta has been captured by the Capitol. District 13 really does exist. There are rebels. There are new leaders. A revolution is unfolding.\n\nIt is by design that Katniss was rescued from the arena in the cruel and haunting Quarter Quell, and it is by design that she has long been part of the revolution without knowing it. District 13 has come out of the shadows and is plotting to overthrow the Capitol. Everyone, it seems, has had a hand in the carefully laid plans—except Katniss.\n\nThe success of the rebellion hinges on Katniss's willingness to be a pawn, to accept responsibility for countless lives, and to change the course of the future of Panem. To do this, she must put aside her feelings of anger and distrust. She must become the rebels' Mockingjay—no matter what the personal cost.",
            "authorid": 2,
            "author": "Suzanne Collins",
            "ratings": 4.12,
            "genre": [
                "Young Adult",
                "Dystopia",
                "Fiction",
                "Fantasy",
                "Science Fiction",
                "Romance",
                "Adventure",
                "Audiobook",
                "Teen",
                "Post Apocalyptic"
            ],
            "year": "September 14, 2008",
            "literaryAwards": [
                "Locus Award Nominee for Best Young Adult Book (2011)",
                "Children's Choice Book Award Nominee for Teen Choice Book of the Year (2011)",
                "Andre Norton Award Nominee (2010)",
                "DABWAHA Romance Tournament for Best Young Adult Romance (2011)",
                "Goodreads Choice Award for Favorite Book and for Young Adult Fantasy (2010)"
            ],
            "originalTitle": "Mokingjay",
            "series": "The Hunger Games #3",
            "setting": [
                "Panem",
                "District 12",
                "The Capitol"
            ],
            "characters": [
                "Katniss Everdeen",
                "Peeta Mellark",
                "Primrose Everdeen",
                "Gale Hawthorne",
                "Haymitch Abernathy",
                "Finnick Odair",
                "Johanna Mason",
                "President Coin",
                "Coriolanus Snow"
            ],
            "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1586722918i/7260188.jpg"
        },
        {
            "id": 5,
            "title": "Divergent",
            "description": "In Beatrice Prior's dystopian Chicago world, society is divided into five factions, each dedicated to the cultivation of a particular virtue—Candor (the honest), Abnegation (the selfless), Dauntless (the brave), Amity (the peaceful), and Erudite (the intelligent). On an appointed day of every year, all sixteen-year-olds must select the faction to which they will devote the rest of their lives. For Beatrice, the decision is between staying with her family and being who she really is—she can't have both. So she makes a choice that surprises everyone, including herself.\n\nDuring the highly competitive initiation that follows, Beatrice renames herself Tris and struggles alongside her fellow initiates to live out the choice they have made. Together they must undergo extreme physical tests of endurance and intense psychological simulations, some with devastating consequences. As initiation transforms them all, Tris must determine who her friends really are—and where, exactly, a romance with a sometimes fascinating, sometimes exasperating boy fits into the life she's chosen. But Tris also has a secret, one she's kept hidden from everyone because she's been warned it can mean death. And as she discovers unrest and growing conflict that threaten to unravel her seemingly perfect society, she also learns that her secret might help her save those she loves . . . or it might destroy her.",
            "authorid": 3,
            "author": "Veronica Roth",
            "ratings": 4.13,
            "genre": [
                "Young Adult",
                "Dystopia",
                "Fantasy",
                "Fiction",
                "Science Fiction",
                "Romance",
                "Adventure",
                "Teen",
                "Audiobook",
                "Book Club"
            ],
            "year": "April 25, 2011",
            "literaryAwards": [
                "Georgia Peach Book Award (2012)",
                "South Carolina Book Award for Young Adult (2014)",
                "Rhode Island Teen Book Award (2013)",
                " Evergreen Teen Book Award (2014)",
                "Soaring Eagle Book Award (2012)",
                "Milwaukee County Teen Book Award Nominee (2012)",
                "Children's Choice Book Award Nominee for Teen Choice Book of the Year (2012)",
                "Sakura Medal",
                "New Mexico Land of Enchantment Award for Young Adult (2014)",
                "Eliot Rosewater Indiana High School Book Award (2014)",
                "California Young Readers Medal for Young Adult (2014)",
                "Lincoln Award Nominee (2014)",
                "DABWAHA Romance Tournament for Best Young Adult Romance (2012)",
                "Goodreads Choice Award for Favorite Book and for Young Adult Fantasy & Science Fiction and Nominee for Goodreads Author (2011)",
                "Green Mountain Book Award (2013)",
                "The Magnolia Award for 6-8 (2014)",
                "Louisiana Teen Readers' Choice (2014)",
                "Gateway Readers Award (2014)",
                "Oklahoma Sequoyah Book Award for High Schol (2014)",
                "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera perteneciente a saga (2011)"
            ],
            "originalTitle": "Divergent",
            "series": "Divergent (#1)",
            "setting": [
                "Chicago",
                "Illinois(United States)"
            ],
            "characters": [
                "Albert",
                "Drew Leighton (Divergent)",
                "Eric (Divergent)",
                "Beatrice Prior",
                "Peter",
                "Caleb Prior",
                "Natalie Prior",
                "Molly Atwood",
                "Christina",
                "Jeanine Matthews",
                "Marcus Eaton",
                "Tobias Eaton"
            ],
            "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1618526890i/13335037.jpg"
        },
        {
            "id": 6,
            "title": "Insurgent",
            "description": "One choice can transform you—or it can destroy you. But every choice has consequences, and as unrest surges in the factions all around her, Tris Prior must continue trying to save those she loves—and herself—while grappling with haunting questions of grief and forgiveness, identity and loyalty, politics and love.\n\nTris's initiation day should have been marked by celebration and victory with her chosen faction; instead, the day ended with unspeakable horrors. War now looms as conflict between the factions and their ideologies grows. And in times of war, sides must be chosen, secrets will emerge, and choices will become even more irrevocable—and even more powerful. Transformed by her own decisions but also by haunting grief and guilt, radical new discoveries, and shifting relationships, Tris must fully embrace her Divergence, even if she does not know what she may lose by doing so.\n\nNew York Times bestselling author Veronica Roth's much-anticipated second book of the dystopian DIVERGENT series is another intoxicating thrill ride of a story, rich with hallmark twists, heartbreaks, romance, and powerful insights about human nature.",
            "authorid": 3,
            "author": "Veronica Roth",
            "ratings": 3.96,
            "genre": [
                "Young Adult",
                "Dystopia",
                "Fantasy",
                "Fiction",
                "Science Fiction",
                "Romance",
                "Adventure",
                "Teen",
                "Audiobook",
                "Post Apocalyptic"
            ],
            "year": "May 1, 2012",
            "literaryAwards": [
                "Romantic Times Reviewers' Choice Award (RT Award) for Young Adult Protagonist (2011)",
                "Goodreads Choice Award for Young Adult Fantasy and Goodreads Author (2012)"
            ],
            "originalTitle": "Insurgent",
            "series": "Divergent (#2)",
            "setting": [
                "Chicago",
                "Illinois(United States)"
            ],
            "characters": [
                "Albert",
                "Drew Leighton (Divergent)",
                "Eric (Divergent)",
                "Beatrice Prior",
                "Peter",
                "Caleb Prior",
                "Natalie Prior",
                "Molly Atwood",
                "Christina",
                "Jeanine Matthews",
                "Marcus Eaton",
                "Tobias Eaton"
            ],
            "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1618525340i/11735983.jpg"
        },
        {
            "id": 7,
            "title": "The Lightning Thief",
            "description": "Percy Jackson is about to be kicked out of boarding school... again. And that's the least of his troubles. Lately, mythological monsters and the gods of Mount Olympus seem to be walking straight out of the pages of Percy's Greek mythology textbook and into his life. And worse, he's angered a few of them. Zeus' master lightning bolt has been stolen, and Percy is the prime suspect.\n\nNow Percy and his friends have just ten days to find and return Zeus' stolen property and bring peace to a warring Mount Olympus. But to succeed on his quest, Percy will have to do more than catch the true thief: he must come to terms with the father who abandoned him; solve the riddle of the Oracle, which warns him of betrayal by a friend; and unravel a treachery more powerful than the gods themselves.",
            "authorid": 4,
            "author": "Rick Riordan",
            "ratings": 4.31,
            "genre": [
                "Fantasy",
                "Young Adult",
                "Mythology",
                "Fiction",
                "Middle Grade",
                "Percy Jackson",
                "Adventure",
                "Greek Mythology",
                "childrens",
                "Audiobook"
            ],
            "year": "July 28, 2005",
            "literaryAwards": [
                "Young Readers' Choice Award (2008)",
                "Books I Loved Best Yearly (BILBY) Awards for Older Readers (2011)",
                "South Carolina Book Award for Junior Book Award (2008)",
                "Grand Canyon Reader Award for Tween Book (2008)",
                "Nene Award (2008)",
                "Massachusetts Children's Book Award (2008)",
                "Pennsylvania Young Readers' Choice Award for Grades 6-8 (2008)",
                "Rhode Island Teen Book Award Nominee (2007)",
                "Sunshine State Young Readers Award for Grades 6-8 (2007)",
                "Pacific Northwest Library Association Young Reader's Choice Award for Intermediate (2008)",
                "Iowa Teen Award (2009)",
                "Lincoln Award Nominee (2009)",
                "Oklahoma Sequoyah Book Award for YA (2008)",
                "Rebecca Caudill Young Readers' Book Award (2009)",
                "Maud Hart Lovelace Award for Grades 6–8 (2009)"
            ],
            "originalTitle": "Percy Jackson and the Lightning Thief",
            "series": "Percy Jackson and the Olympians (#1), Camp Half-Blood Chronicles (#1), Coleccionable Percy Jackson (#1)",
            "setting": [
                "New York City",
                "New York (United States)",
                "Montauk",
                "New York (United States)",
                "New Jersey (United States)",
                "St. Louis",
                "Missouri (United States)",
                " Las Vegas",
                "Nevada (United States)",
                "Long Island",
                "New York (United States)",
                "Los Angeles",
                "California (United States)",
                "Santa Monica",
                "California (United States)",
                "Denver",
                "Colorado (United States)"
            ],
            "characters": [
                "Annabeth Chase",
                "Grover Underwood",
                "Luke Castellan",
                "Zeus (Greek mythology)",
                "Dionysus (mythology)",
                "Ares (god)",
                "Chiron",
                "Percy Jackson",
                "Poseidon",
                "Hades (Greek God)"
            ],
            "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1684776677i/123675190.jpg"
        },
        {
            "id": 8,
            "title": "The Maze Runner",
            "description": "If you ain’t scared, you ain’t human.\n\nWhen Thomas wakes up in the lift, the only thing he can remember is his name. He’s surrounded by strangers—boys whose memories are also gone.\n\nNice to meet ya, shank. Welcome to the Glade.\n\nOutside the towering stone walls that surround the Glade is a limitless, ever-changing maze. It’s the only way out—and no one’s ever made it through alive.\n\nEverything is going to change.\n\nThen a girl arrives. The first girl ever. And the message she delivers is terrifying.\n\nRemember. Survive. Run.",
            "authorid": 5,
            "author": "James Dashner",
            "ratings": 4.31,
            "genre": [
                "Young Adult",
                "Dystopia",
                "Science Fiction",
                "Fiction",
                "Fantasy",
                "Adventure",
                "Audiobook",
                "Mystery",
                "Post Apocalyptic",
                "Teen"
            ],
            "year": "October 6, 2009",
            "literaryAwards": [
                "Georgia Peach Book Award (2011)",
                "Utah Book Award Nominee for Young Adults (2009)",
                "Romantic Times Reviewers' Choice Award (RT Award) Nominee for Best Young Adult Paranormal/Fantasy Novel (2009)",
                "Charlotte Award (2012)",
                "Pennsylvania Young Readers' Choice Award Nominee (2011)",
                "Evergreen Teen Book Award (2012)",
                "Milwaukee County Teen Book Award Nominee (2011)",
                "Lincoln Award (2012)",
                "Truman Readers Award (2012)"
            ],
            "originalTitle": "The Maze Runner",
            "series": "The Maze Runner (#1)",
            "characters": [
                "Chuck",
                "Teresa Agnes",
                "Minho",
                "Alby",
                "Gally",
                "Thomas (Maze Runner)",
                "Ben",
                "Newt"
            ],
            "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1375596592i/6186357.jpg"
        },
        {
            "id": 9,
            "title": "Throne of Glass",
            "description": "In a land without magic, where the king rules with an iron hand, an assassin is summoned to the castle. She comes not to kill the king, but to win her freedom. If she defeats twenty-three killers, thieves, and warriors in a competition, she is released from prison to serve as the king's champion. Her name is Celaena Sardothien.\n\nThe Crown Prince will provoke her. The Captain of the Guard will protect her. But something evil dwells in the castle of glass—and it's there to kill. When her competitors start dying one by one, Celaena's fight for freedom becomes a fight for survival, and a desperate quest to root out the evil before it destroys her world.",
            "authorid": 6,
            "author": "Sarah J. Maas",
            "ratings": 4.31,
            "genre": [
                "Fantasy",
                "Young Adult",
                "Romance",
                "Fiction",
                "Romantasy",
                "Magic",
                "Young Adult Fantasy",
                "Audiobook",
                "High Fantasy",
                "Post Apocalyptic",
                "Fae"
            ],
            "year": "October 6, 2009",
            "literaryAwards": [
                "Lincoln Award Nominee (2015)",
                "North Carolina Young Adult Book Award for High School (2015)",
                " Goodreads Choice Award Nominee for Young Adult Fantasy & Science Fiction (2012)"
            ],
            "originalTitle": "Throne of Glass",
            "series": "Throne of Glass (#1)",
            "setting": [
                "Rifthold",
                "Adarlan"
            ],
            "characters": [
                "Celaena Sardothien",
                "Chaol Westfall",
                "Prince Dorian Havilliard",
                "Princess Nehemia Ytger",
                "Kaltain Rompier"
            ],
            "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1673566495i/76703559.jpg"
        }
    ]
}